'use strict'
import React, {Component} from 'react'
import ReactDOM from 'react-dom'


const text = "山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷山东老家阿的江房间山东老家；恶疾sad会计法；积极点；离开家阿萨德；；；阿娇是否；阿拉斯加分；看见了快捷";

class TextDemo extends Component {
  constructor() {
    super()
  }

  render () {
    let items = [];
    for(let value of text) {
      let item = (<span>{value}</span>);
      items.push(item);
    }
    return (
      <div style={{backgroundColor:'red',width:'1000px',wordWrap:'break-word'}}>
        {items}
      </div>
    )
  }
}

ReactDOM.render(
  <TextDemo />,
  document.getElementById('root')
);